In [335]:
import pandas as pd
import numpy as np
df = pd.read_csv("large_messy_data.csv")

df.head()

,Name,Age,Email,Join_Date,Salary,Department
0,John O'Connell,NaN,john_o'connell@email.com,2016-09-16,NaN,HR
1,Alice Davis,20.0,alice_davis@mail.net,2020-05-22,NaN,Marketing
2,Laura Brown,NaN,laura_brown@mail.net,2016-12-11,91867.0,HR
3,Sam Smith,21.0,sam_smith@email.com,28/06/2025,35874.0,Finance
4,Sarah Doe,NaN,sarah_doe@fake.com,2015-04-17,NaN,HR

In [336]:
#info about data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        952 non-null    object
 1   Age         505 non-null    float64
 2   Email       1000 non-null   object
 3   Join_Date   1000 non-null   object
 4   Salary      331 non-null    float64
 5   Department  878 non-null    object
dtypes: float64(2), object(4)
memory usage: 47.0+ KB

In [337]:
#description of the data
df.describe(include="all")

,Name,Age,Email,Join_Date,Salary,Department
count,952,505.000000,1000,1000,331.000000,878
unique,188,NaN,508,692,NaN,7
top,Sam White,NaN,invalid_email,2025-01-01,NaN,HR
freq,12,NaN,138,264,NaN,141
mean,NaN,29.778218,NaN,NaN,64930.305136,NaN
std,NaN,13.203322,NaN,NaN,20792.188829,NaN
min,NaN,20.000000,NaN,NaN,30075.000000,NaN
25%,NaN,20.000000,NaN,NaN,46288.000000,NaN
50%,NaN,20.000000,NaN,NaN,65522.000000,NaN
75%,NaN,41.000000,NaN,NaN,83004.000000,NaN
max,NaN,60.000000,NaN,NaN,99952.000000,NaN

In [338]:
#Handling missing values
df.isnull().sum()

Name           48
Age           495
Email           0
Join_Date       0
Salary        669
Department    122
dtype: int64

In [339]:
#droping rows with missing values

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        952 non-null    object
 1   Age         505 non-null    float64
 2   Email       1000 non-null   object
 3   Join_Date   1000 non-null   object
 4   Salary      331 non-null    float64
 5   Department  878 non-null    object
dtypes: float64(2), object(4)
memory usage: 47.0+ KB

In [340]:
#filling 
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

df['Age'] = df['Age'].fillna(df['Age'].median())

In [341]:

df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors='coerce', dayfirst=True, format=None)

# Replace NaT with "2025-01-01"
df['Join_Date'].fillna(pd.Timestamp("2025-01-02"), inplace=True)

C:\Users\david\AppData\Local\Temp\ipykernel_3636\3147205420.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors='coerce', dayfirst=True, format=None)
C:\Users\david\AppData\Local\Temp\ipykernel_3636\3147205420.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Join_Date'].fillna(pd.Timestamp("2025-01-02"), inplace=True)

In [342]:
#salary
df['Salary'] =pd.to_numeric(df['Salary'], errors='coerce')
df["Salary"]= df["Salary"].fillna(df["Salary"].median())

In [343]:
df_cleaned = df.dropna()

print(df_cleaned)

                Name   Age                     Email  Join_Date   Salary  \
0     John O'Connell  20.0  john_o'connell@email.com 2016-09-16  65522.0
1        Alice Davis  20.0      alice_davis@mail.net 2020-05-22  65522.0
2        Laura Brown  20.0      laura_brown@mail.net 2016-12-11  91867.0
3          Sam Smith  21.0       sam_smith@email.com 2025-01-02  35874.0
4          Sarah Doe  20.0        sarah_doe@fake.com 2015-04-17  65522.0
..               ...   ...                       ...        ...      ...
994         Lisa Doe  54.0         lisa_doe@fake.com 2025-01-01  65522.0
996       Alex Green  40.0      alex_green@email.com 2025-06-06  65522.0
997  Emily O'Connell  20.0  emily_o'connell@mail.net 2022-04-21  65522.0
998          Tom Doe  20.0          tom_doe@mail.net 2025-01-01  94375.0
999     Emily Miller  20.0    emily_miller@email.com 2023-05-14  65522.0

    Department
0           HR
1    Marketing
2           HR
3      Finance
4           HR
..         ...
994         IT
996      Sales
997      Sales
998    Finance
999      Sales

[836 rows x 6 columns]

saving the df

In [344]:
df.to_csv('cleaned_data.csv', index=False)